<a href="https://colab.research.google.com/github/shivampip/python-for-finance/blob/master/03-%20General%20Pandas/Pandas_Practice.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

### Pandas Practice

In [0]:
import numpy as np
import pandas as pd

In [0]:
DATA_URL= "https://raw.githubusercontent.com/shivampip/python-for-finance/master/03-%20General%20Pandas/Pandas-Exercises/banklist.csv"
df= pd.read_csv(DATA_URL)

In [3]:
df.head()

                                           Bank Name  ... Updated Date
0                                Fayette County Bank  ...     1-Jun-17
1  Guaranty Bank, (d/b/a BestBank in Georgia & Mi...  ...     1-Jun-17
2                                     First NBC Bank  ...    23-May-17
3                                      Proficio Bank  ...    18-May-17
4                      Seaway Bank and Trust Company  ...    18-May-17

[5 rows x 7 columns]

In [4]:
df.columns

Index(['Bank Name', 'City', 'ST', 'CERT', 'Acquiring Institution',
       'Closing Date', 'Updated Date'],
      dtype='object')

In [5]:
df.shape

(551, 7)

In [0]:
df['Bank Name'].unique()

In [7]:
df['Bank Name'].nunique()

535

In [9]:
df['Acquiring Institution'].nunique()

286

In [11]:
df['Acquiring Institution'].value_counts().head()

No Acquirer                            31
State Bank and Trust Company           12
First-Citizens Bank & Trust Company    11
Ameris Bank                            10
U.S. Bank N.A.                          9
Name: Acquiring Institution, dtype: int64

In [12]:
df['CERT'].mean()

31729.392014519057

In [15]:
df[df['CERT']> df['CERT'].mean()].shape

(283, 7)

In [17]:
df[(df['CERT']> df['CERT'].mean()) & (df['City']=='Chicago')]

                                      Bank Name  ... Updated Date
14                               Edgebrook Bank  ...    12-Jul-16
99                                New City Bank  ...    29-Oct-12
190                Community First Bank Chicago  ...    20-Aug-12
252                             Ravenswood Bank  ...    22-Aug-12
307                            New Century Bank  ...    23-Aug-12
308  Citizens Bank and Trust Company of Chicago  ...     5-Jun-14

[6 rows x 7 columns]

In [0]:
def rootNikalo(num):
    return np.sqrt(num)

In [19]:
df['CERT'].apply(rootNikalo).head()

0     42.449971
1    173.213741
2    241.458071
3    188.401168
4    139.025178
Name: CERT, dtype: float64

In [20]:
df['Bank Name'].apply(lambda name: name.upper()).head()

0                                  FAYETTE COUNTY BANK
1    GUARANTY BANK, (D/B/A BESTBANK IN GEORGIA & MI...
2                                       FIRST NBC BANK
3                                        PROFICIO BANK
4                        SEAWAY BANK AND TRUST COMPANY
Name: Bank Name, dtype: object

In [21]:
df['CERT'].sum()

17482895

In [22]:
df['ST'].unique()

array(['IL', 'WI', 'LA', 'UT', 'NJ', 'AR', 'GA', 'PA', 'TN', 'WA', 'CO',
       'PR', 'FL', 'MN', 'CA', 'MD', 'OK', 'OH', 'SC', 'VA', 'ID', 'TX',
       'CT', 'AZ', 'NV', 'NC', 'KY', 'MO', 'KS', 'AL', 'MI', 'IN', 'IA',
       'NE', 'MS', 'NM', 'OR', 'NY', 'MA', 'SD', 'WY', 'WV', 'NH', 'HI'],
      dtype=object)

In [0]:
del df['Updated Date']

In [24]:
df.head(2)

                                           Bank Name  ... Closing Date
0                                Fayette County Bank  ...    26-May-17
1  Guaranty Bank, (d/b/a BestBank in Georgia & Mi...  ...     5-May-17

[2 rows x 6 columns]

In [26]:
df.index

RangeIndex(start=0, stop=551, step=1)

In [28]:
df.sort_values(by='City').head()

                   Bank Name  ... Closing Date
257   Northwest Bank & Trust  ...    30-Jul-10
80   Montgomery Bank & Trust  ...     6-Jul-12
537            Bank of Alamo  ...     8-Nov-02
275   High Desert State Bank  ...    25-Jun-10
124             Country Bank  ...    14-Oct-11

[5 rows x 6 columns]

In [33]:
df.isnull().sum()

Bank Name                0
City                     0
ST                       0
CERT                     0
Acquiring Institution    0
Closing Date             0
dtype: int64

In [34]:
df['City'].value_counts().head()

Chicago       18
Atlanta       10
Phoenix        6
Naples         5
Alpharetta     4
Name: City, dtype: int64

In [35]:
df.nunique()

Bank Name                535
City                     424
ST                        44
CERT                     551
Acquiring Institution    286
Closing Date             247
dtype: int64

In [0]:
by_st= df.groupby(by="ST")

In [43]:
by_st.mean().head()

            CERT
ST
AL  23105.714286
AR  30681.333333
AZ  45201.062500
CA  34795.560976
CO  35057.400000

In [45]:
df.groupby(by="ST").min().head()

                                   Bank Name  ... Closing Date
ST                                            ...
AL  Alabama Trust Bank, National Association  ...    14-Aug-09
AR                         ANB Financial, NA  ...    17-Dec-10
AZ                            Bank USA, N.A.  ...    11-Dec-09
CA                       1st Centennial Bank  ...    11-Feb-11
CO                            Bank of Choice  ...    10-Apr-09

[5 rows x 5 columns]

In [47]:
df.groupby(by="ST").count().head()

    Bank Name  City  CERT  Acquiring Institution  Closing Date
ST
AL          7     7     7                      7             7
AR          3     3     3                      3             3
AZ         16    16    16                     16            16
CA         41    41    41                     41            41
CO         10    10    10                     10            10

In [53]:
df.groupby(by="ST").describe().transpose()['AL']

CERT  count        7.000000
      mean     23105.714286
      std       8728.675820
      min       9609.000000
      25%      18772.000000
      50%      22130.000000
      75%      28616.500000
      max      35224.000000
Name: AL, dtype: float64